#include <stdio.h>
#include <stdlib.h>

int main()
{
    char a = -1;
    // 10000000000000000000000000000001--原码
    // 11111111111111111111111111111110--反码
    // 11111111111111111111111111111111--补码-> -1 = 11111111111111111111111111111111
    // -1的补码放char里从右到左发生截断->11111111-> a = 11111111
    // 11111111要以%d打印发生整形提升（有符号数整形提升补符号数，无符号数整形提升补0）
    // 整形提升后->11111111111111111111111111111111->(-1)
    signed char b = -1;
    //同理，char默认为signed char
    unsigned char c = -1;
    // 10000000000000000000000000000001--原码
    // 11111111111111111111111111111110--反码
    // 11111111111111111111111111111111--补码
    // 放char里右到左截断后->11111111
    //整形提升后->00000000000000000000000011111111->(255)
    printf("a = %d b = %d c = %d\n",a,b,c);
    system("pause");
    return 0;
}