#include <stdlib.h>

int main()
{
    float f = 5.5;
    /*
    5.5
    二进制序列->101.1
    (-1)*0 * 1.011  * 2*2
    s=0(float->1bit)(double->1bit)
    m=1.011(float->23bit)(double->52bit)
    e=2(float->8bit(实际+中间数127))(double->11bit（实际+中间数1023）)
    实际内存存放
    s e+127         m(1默认不用存，可以多一位精度),整形向前补0，浮点型向后补0
    0 10000001 01100000000000000000000
    就是:
    01000000101100000000000000000000
    即：
    0100 0000 1011 0000 0000 0000 0000 0000
    0x40b00000
    小端存储
    00 00 b0 40 
    */
   system("pause");
   return 0;
}